# 🔑 Замени на свои значения с https://my.telegram.org/apps
API_ID = '26470938'
API_HASH = 'cf9a190d70e0d0e36b2e57cfafc342b8'
PHONE = '+995510002153'  # Твой номер для входа

# 🆔 ID чата или юзернейм канала (например, "@my_public_channel" или -1001234567890)
# CHAT_ID = "@test324852"  # или просто "my_public_channel"
# Если знаешь точный ID: CHAT_ID = -1001234567890
CHAT_ID = ["@test324852", "@test324852_2", "@test_channel_324852_1"]

# 📁 Файл сессии — сохраняет авторизацию
SESSION_NAME = "session_name"

# 🕒 Интервал проверки в секундах
CHECK_INTERVAL = 10


